name: "LeNet"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}


layer {
  name: "1_conv1"
  type: "Convolution"
  bottom: "data"
  top: "1_conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "1_pool1"
  type: "Pooling"
  bottom: "1_conv1"
  top: "1_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "1_conv2"
  type: "Convolution"
  bottom: "1_pool1"
  top: "1_conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "1_pool2"
  type: "Pooling"
  bottom: "1_conv2"
  top: "1_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "1_ip1"
  type: "InnerProduct"
  bottom: "1_pool2"
  top: "1_ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "1_relu1"
  type: "ReLU"
  bottom: "1_ip1"
  top: "1_ip1"
}
layer {
  name: "1_ip2"
  type: "InnerProduct"
  bottom: "1_ip1"
  top: "1_ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "1_prob"
  type: "Softmax"
  bottom: "1_ip2"
  top: "1_prob"
}




layer {
  name: "2_conv1"
  type: "Convolution"
  bottom: "data"
  top: "2_conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "2_pool1"
  type: "Pooling"
  bottom: "2_conv1"
  top: "2_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "2_conv2"
  type: "Convolution"
  bottom: "2_pool1"
  top: "2_conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "2_pool2"
  type: "Pooling"
  bottom: "2_conv2"
  top: "2_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "2_ip1"
  type: "InnerProduct"
  bottom: "2_pool2"
  top: "2_ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "2_relu1"
  type: "ReLU"
  bottom: "2_ip1"
  top: "2_ip1"
}
layer {
  name: "2_ip2"
  type: "InnerProduct"
  bottom: "2_ip1"
  top: "2_ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "2_prob"
  type: "Softmax"
  bottom: "2_ip2"
  top: "2_prob"
}

layer {
  name: "3_conv1"
  type: "Convolution"
  bottom: "data"
  top: "3_conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "3_pool1"
  type: "Pooling"
  bottom: "3_conv1"
  top: "3_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "3_conv2"
  type: "Convolution"
  bottom: "3_pool1"
  top: "3_conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "3_pool2"
  type: "Pooling"
  bottom: "3_conv2"
  top: "3_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "3_ip1"
  type: "InnerProduct"
  bottom: "3_pool2"
  top: "3_ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "3_relu1"
  type: "ReLU"
  bottom: "3_ip1"
  top: "3_ip1"
}
layer {
  name: "3_ip2"
  type: "InnerProduct"
  bottom: "3_ip1"
  top: "3_ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "3_prob"
  type: "Softmax"
  bottom: "3_ip2"
  top: "3_prob"
}

layer {
  name: "1_accuracy"
  type: "Accuracy"
  bottom: "1_prob"
	bottom: "label"
  top: "1_accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "2_accuracy"
  type: "Accuracy"
  bottom: "2_prob"
  bottom: "label"
  top: "2_accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "3_accuracy"
  type: "Accuracy"
  bottom: "3_prob"
  bottom: "label"
  top: "3_accuracy"
  include {
    phase: TEST
  }
}

layer {
  name: "accuracy"
  type: "OracleAccuracy"
  bottom: "1_prob"
	bottom: "2_prob"
	bottom: "3_prob"
  bottom: "label"
  top: "oracle accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "MCLMultinomialLogisticLoss"
  bottom: "1_prob"
	bottom: "2_prob"
	bottom: "3_prob"
  bottom: "label"
  top: "multiple-output loss"
	include {
    phase: TRAIN
  }
}
